IRP/src/Catalogs/Taxes/Taxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Taxes</name>
 <attributes>
  <name>ExternalDataProcSettings</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_ExternalDataProc</name>
  <type>
   <types>CatalogRef.ExternalDataProc</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.TaxType</types>
  </type>
 </attributes>
 <attributes>
  <name>Kind</name>
  <type>
   <types>EnumRef.TaxKind</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxPayer</name>
  <type>
   <types>EnumRef.TaxPayers</types>
  </type>
 </attributes>
 <tabularSections>
  <name>TaxRates</name>
  <attributes>
   <name>TaxRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>UseDocuments</name>
  <attributes>
   <name>DocumentName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>TransactionTypes</name>
  <attributes>
   <name>DocumentName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>TransactionType</name>
   <type>
    <types>EnumRef</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Taxes/Forms/ChoiceTransactionTypes/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.DocumentName = Parameters.DocumentName;
	For Each Row In Parameters.TransactionTypes Do
		NewRow = ThisObject.TransactionTypes.Add();
		NewRow.TransactionType = Row.TransactionType;
		NewRow.Use = Row.Use;
	EndDo;
EndProcedure

&AtClient
Procedure Ok(Command)
	Result = New Structure();
	Result.Insert("DocumentName", ThisObject.DocumentName);
	ArrayOfTransactionTypes = New Array();
	For Each Row In ThisObject.TransactionTypes Do
		If Not Row.Use Then
			Continue;
		EndIf;
		ArrayOfTransactionTypes.Add(New Structure("TransactionType", Row.TransactionType));
	EndDo;
	Result.Insert("TransactionTypes", ArrayOfTransactionTypes);
	Close(Result);
EndProcedure

&AtClient
Procedure Cancel(Command)
	Close(Undefined);
EndProcedure

&AtClient
Procedure TransactionTypesBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure TransactionTypesBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure
